src/InformationRegisters/КИИ_СерверMCPОграниченияВызовов/КИИ_СерверMCPОграниченияВызовов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_СерверMCPОграниченияВызовов</name>
  <comment>Скользящее окно для rate-limit: счетчик вызовов на (Вызывающий, КодМинуты). Чистка старых записей вне scope v0.1.</comment>
  <resources>
    <name>Количество</name>
    <comment>Накопленный счетчик за минуту. Reset происходит сменой КодМинуты.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вызывающий</name>
    <comment>Идентификатор клиента (имя пользователя или IP).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМинуты</name>
    <comment>Bucket-ключ минуты в формате YYYY-MM-DD-HH-mm (UTC).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/КИИ_СерверMCPОграничения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает НЕспуфабельный ключ бакета ограничений из результата аутентификации.
// Аутентифицированный запрос → per-user бакет (по имени пользователя). Неаутенти-
// фицированный → единый глобальный бакет: атакующий НЕ может получить свежий бакет
// ротацией заявленного username / заголовка X-Forwarded-For (закрывает обход
// rate-limit перебором пароля, дефект D8). Заявленный идентификатор пригоден только
// для аудита (форензика), но НЕ как ключ ограничения.
//
// Параметры:
//  РезультатAuth - Структура - результат КИИ_СерверMCPAuth.ПроверитьBasicAuth:
//    * Авторизован  - Булево - прошла ли аутентификация
//    * Пользователь - Строка - имя пользователя
//
// Возвращаемое значение:
//  Строка - ключ бакета ограничений (не длиннее 100 символов)
//
Функция ПолучитьКлючОграничения(Знач РезультатAuth) Экспорт

	АвторизованныйПользователь = ТипЗнч(РезультатAuth) = Тип("Структура")
		И РезультатAuth.Свойство("Авторизован")
		И РезультатAuth.Авторизован = Истина
		И ЗначениеЗаполнено(РезультатAuth.Пользователь);

	Если АвторизованныйПользователь Тогда
		Возврат "user:" + Лев(Строка(РезультатAuth.Пользователь), 90);
	КонецЕсли;

	Возврат КлючНеаутентифицированных();

КонецФункции

// Проверяет лимит вызовов 60/мин для одного caller.
// Не модифицирует регистр, только читает текущий счетчик.
//
// Параметры:
//  Вызывающий - Строка - идентификатор клиента
//
// Возвращаемое значение:
//  Структура:
//    * Разрешено       - Булево - можно ли продолжить
//    * ОставшийсяЛимит - Число - сколько осталось до конца минуты
//    * ПовторитьЧерез  - Число - секунд до сброса счетчика
//
Функция ПроверитьЛимит(Знач Вызывающий, Знач ДатаПроверки = Неопределено) Экспорт
	
	// ДатаПроверки - сеам для детерминированных тестов (граница минуты давала флап);
	// прод не передает параметр и живет по текущему времени.
	Если ДатаПроверки = Неопределено Тогда
		ДатаПроверки = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	КодМинуты = ПолучитьКодМинуты(ДатаПроверки);
	ТекущееКоличество = ПолучитьКоличествоВызовов(Вызывающий, КодМинуты);
	ТекущийЛимит = Лимит();
	
	Результат = Новый Структура;
	Результат.Вставить("Разрешено", ТекущееКоличество < ТекущийЛимит);
	ОстатокЛимита = ТекущийЛимит - ТекущееКоличество;
	Результат.Вставить("ОставшийсяЛимит", ?(ОстатокЛимита > 0, ОстатокЛимита, 0));
	Результат.Вставить("ПовторитьЧерез", 60 - Секунда(ДатаПроверки));
	Возврат Результат;

КонецФункции

// Атомарно проверяет и фиксирует лимит: под блокировкой (Вызывающий, КодМинуты)
// читает счетчик и, если он ниже лимита, инкрементит - все в ОДНОЙ транзакции.
// Закрывает гонку check→increment (несколько параллельных запросов проходили проверку
// по старому значению до инкремента). Отклоненный запрос счетчик НЕ трогает.
// При сбое учета - fail-open (не роняем сервис), ошибка пишется в журнал.
//
// Параметры:
//  Вызывающий - Строка - идентификатор клиента
//
// Возвращаемое значение:
//  Структура:
//    * Разрешено       - Булево - можно ли продолжить (и слот уже зафиксирован)
//    * ОставшийсяЛимит - Число - сколько осталось до конца минуты
//    * ПовторитьЧерез  - Число - секунд до сброса счетчика
//
Функция ПроверитьИЗафиксироватьЛимит(Знач Вызывающий) Экспорт

	ДатаПроверки = ТекущаяУниверсальнаяДата();
	КодМинуты = ПолучитьКодМинуты(ДатаПроверки);
	ТекущийЛимит = Лимит();

	Результат = Новый Структура;
	Результат.Вставить("Разрешено", Ложь);
	Результат.Вставить("ОставшийсяЛимит", 0);
	Результат.Вставить("ПовторитьЧерез", 60 - Секунда(ДатаПроверки));

	Попытка

		НачатьТранзакцию();
		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КИИ_СерверMCPОграниченияВызовов");
			ЭлементБлокировки.УстановитьЗначение("Вызывающий", Вызывающий);
			ЭлементБлокировки.УстановитьЗначение("КодМинуты", КодМинуты);
			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.КИИ_СерверMCPОграниченияВызовов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Вызывающий.Установить(Вызывающий);
			НаборЗаписей.Отбор.КодМинуты.Установить(КодМинуты);
			НаборЗаписей.Прочитать();

			ТекущееКоличество = 0;
			Если НаборЗаписей.Количество() > 0 Тогда
				ТекущееКоличество = НаборЗаписей[0].Количество;
			КонецЕсли;

			Если ТекущееКоличество < ТекущийЛимит Тогда
				НаборЗаписей.Очистить();
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Вызывающий = Вызывающий;
				НоваяЗапись.КодМинуты = КодМинуты;
				НоваяЗапись.Количество = ТекущееКоличество + 1;
				НаборЗаписей.Записать();
				Результат.Разрешено = Истина;
				Результат.ОставшийсяЛимит = ТекущийЛимит - (ТекущееКоличество + 1);
			КонецЕсли;

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

		ОчиститьУстаревшиеЗаписи();

	Исключение

		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Ограничения'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки);
		// fail-open: сбой учета не должен ронять сервис
		Результат.Разрешено = Истина;
		Результат.ОставшийсяЛимит = ТекущийЛимит;

	КонецПопытки;

	Возврат Результат;

КонецФункции

// Увеличивает счетчик вызовов на 1 для текущей минуты.
//
// Параметры:
//  Вызывающий - Строка - идентификатор клиента
//
Процедура ЗафиксироватьВызов(Знач Вызывающий, Знач ДатаПроверки = Неопределено) Экспорт
	
	// ДатаПроверки - сеам для детерминированных тестов (см. ПроверитьЛимит).
	Если ДатаПроверки = Неопределено Тогда
		ДатаПроверки = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	КодМинуты = ПолучитьКодМинуты(ДатаПроверки);
	
	Попытка
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КИИ_СерверMCPОграниченияВызовов");
			ЭлементБлокировки.УстановитьЗначение("Вызывающий", Вызывающий);
			ЭлементБлокировки.УстановитьЗначение("КодМинуты", КодМинуты);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.КИИ_СерверMCPОграниченияВызовов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Вызывающий.Установить(Вызывающий);
			НаборЗаписей.Отбор.КодМинуты.Установить(КодМинуты);
			НаборЗаписей.Прочитать();
			
			ТекущееКоличество = 0;
			Если НаборЗаписей.Количество() > 0 Тогда
				ТекущееКоличество = НаборЗаписей[0].Количество;
			КонецЕсли;
			
			НаборЗаписей.Очистить();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Вызывающий = Вызывающий;
			НоваяЗапись.КодМинуты = КодМинуты;
			НоваяЗапись.Количество = ТекущееКоличество + 1;
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		ОчиститьУстаревшиеЗаписи();
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Ограничения'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Best-effort удаление записей старше окна ретенции (дефект D3″: регистр
// рос неограниченно). Сбой чистки НЕ влияет на счетчик (вызывается после
// фиксации транзакции счетчика).
Процедура ОчиститьУстаревшиеЗаписи()
	
	Попытка
		
		ПорогМинуты = ПолучитьКодМинуты(ТекущаяУниверсальнаяДата() - 300);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ограничения.Вызывающий КАК Вызывающий,
		|	Ограничения.КодМинуты КАК КодМинуты
		|ИЗ
		|	РегистрСведений.КИИ_СерверMCPОграниченияВызовов КАК Ограничения
		|ГДЕ
		|	Ограничения.КодМинуты < &ПорогМинуты";
		Запрос.УстановитьПараметр("ПорогМинуты", ПорогМинуты);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.КИИ_СерверMCPОграниченияВызовов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Вызывающий.Установить(Выборка.Вызывающий);
			НаборЗаписей.Отбор.КодМинуты.Установить(Выборка.КодМинуты);
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Ограничения'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьКоличествоВызовов(Знач Вызывающий, Знач КодМинуты)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ограничения.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.КИИ_СерверMCPОграниченияВызовов КАК Ограничения
	|ГДЕ
	|	Ограничения.Вызывающий = &Вызывающий
	|	И Ограничения.КодМинуты = &КодМинуты";
	
	Запрос.УстановитьПараметр("Вызывающий", Вызывающий);
	Запрос.УстановитьПараметр("КодМинуты", КодМинуты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьКодМинуты(Знач ДатаМинуты)
	
	Возврат Формат(ДатаМинуты, "ДФ='yyyy-MM-dd-HH-mm'");
	
КонецФункции

Функция КлючНеаутентифицированных()

	Возврат "anon:global";

КонецФункции

Функция Лимит()

	Возврат 60;

КонецФункции

#КонецОбласти
